Revit 2027 API
Dimension.HasOneSegment Method
 Determines whether a dimension has one segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasOneSegment()
Public Function HasOneSegment As Boolean
public:
bool HasOneSegment()
member HasOneSegment : unit -> bool
Return Value
Boolean
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace